src/Documents/ИзменениеБанковскихРеквизитов/ИзменениеБанковскихРеквизитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзменениеБанковскихРеквизитов</name>
  <attributes>
    <name>ДатаОбращения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступленияДокументовНаБумажномНосителе</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаналПоступления</name>
    <type>
      <types>EnumRef.КаналПоступления</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаАнкету</name>
    <type>
      <types>DocumentRef.Анкета</types>
    </type>
  </attributes>
</mdclass:Document>

src/InformationRegisters/АнкетаОпросник/АнкетаОпросник.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АнкетаОпросник</name>
  <resources>
    <name>СтатусФизическогоЛица</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Гражданство</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЯвляетсяНалогоплатильщикомИностранногоГосударства</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтранаНалогоплатильщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаличиеДвойногоГражданства</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтраныДвойногоГражданства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипПДЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МестоРаботы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИсточникДохода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтепеньРодства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>БенефициарныйВладелец</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СведенияОВыгодприобретателях</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЦельУстановленияДеловыхОтношенийСФондом</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПредполагаемыйХарактер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОсновныеЦелиФинХоз</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СведенияОТекФинСостоянии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДеловаяРепутация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОсновнойИсточникДохода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДолжностьРодственника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МестоРаботыРодственника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИсточникДоходаРодственника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DefinedType.ДокументАнкетыОпросника</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/КаналПоступления/КаналПоступления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КаналПоступления</name>
  <enumValues>
    <name>Лично</name>
  </enumValues>
  <enumValues>
    <name>Почтой</name>
  </enumValues>
  <enumValues>
    <name>ЧерезБанкПартнер</name>
  </enumValues>
  <enumValues>
    <name>Интернет</name>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ИзменениеБанковскихРеквизитов/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура Декорация1Нажатие(Элемент)
	Если НЕ Параметры.Ключ.Пустая() Тогда
		Если НЕ АнкетаЗаполнена Тогда
			ПараметрыФормы = Новый Структура("Документ",Объект.Ссылка );
			ОткрытьФорму("РегистрСведений.АнкетаОпросник.Форма.ФормаЗаписи",ПараметрыФормы,ЭтаФорма,,,,Новый ОписаниеОповещения("ПроверкаАнкеты",ЭтотОбъект),);
		Иначе
			ПараметрыФормы = Новый Структура("Документ",Объект.Ссылка );
			МассивКлюча = Новый Массив;
			МассивКлюча.Добавить(ПараметрыФормы);
			КлючЗаписи = Новый ("РегистрСведенийКлючЗаписи.АнкетаОпросник", МассивКлюча);
			СтруктураКлюча = Новый Структура;
			СтруктураКлюча.Вставить("Ключ", КлючЗаписи);
			ОткрытьФорму("РегистрСведений.АнкетаОпросник.Форма.ФормаЗаписи", СтруктураКлюча);
		КонецЕсли;
	Иначе
		Оповещение = Новый ОписаниеОповещения("ОтветНаВопрос",ЭтотОбъект);
		ТекстВопроса = "Перед продолжением нужно записать документ. Продолжить?";
		ПоказатьВопрос(Оповещение,ТекстВопроса,РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаАнкеты(ФейкПар1=Неопределено,ФейкПар2=Неопределено) Экспорт
	АнкетаЗаполнена = ПроверкаАнкетыНаСервере();
	Если АнкетаЗаполнена Тогда
		Элементы.СсылкаАнкета.Заголовок = "Просмотр и изменение анкеты";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверкаАнкетыНаСервере()
	Если Не Параметры.Ключ.Пустая() Тогда
		РС = РегистрыСведений.АнкетаОпросник.Выбрать(Новый Структура("Документ",Параметры.Ключ));
		Если РС.Следующий() Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ОтветНаВопрос(Результат,ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаписатьНаСервере();
		ПараметрыФормы = Новый Структура("Документ",Объект.Ссылка );
		ОткрытьФорму("РегистрСведений.АнкетаОпросник.Форма.ФормаЗаписи",ПараметрыФормы,ЭтаФорма,,,,Новый ОписаниеОповещения("ПроверкаАнкеты",ЭтотОбъект));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	ЭтотОбъект.Записать();	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не Параметры.Ключ.Пустая() Тогда
		ПроверкаАнкеты();
	КонецЕсли;
	УстановитьВидимость();	
КонецПроцедуры

&НаКлиенте
Процедура КаналПоступленияПриИзменении(Элемент)
	КаналПоступленияПриИзмененииНаСервере()	
КонецПроцедуры

&НаСервере
Процедура КаналПоступленияПриИзмененииНаСервере()
	Если Объект.КаналПоступления = Перечисления.КаналПоступления.Лично Тогда
		Если Объект.ДатаОбращения = Дата(1,1,1) Тогда
			Объект.ДатаОбращения = ТекущаяДата();
		КонецЕсли;
		Если Объект.ДатаРегистрации = Дата(1,1,1) Тогда
			Объект.ДатаРегистрации =    ТекущаяДата();
		КонецЕсли;
	ИначеЕсли Объект.КаналПоступления = Перечисления.КаналПоступления.ЧерезБанкПартнер  Тогда
		Если Объект.ДатаОбращения = Дата(1,1,1) Тогда
			Объект.ДатаОбращения = ТекущаяДата();
		КонецЕсли;
		Если Объект.ДатаРегистрации = Дата(1,1,1) Тогда
			Объект.ДатаРегистрации =    ТекущаяДата();
		КонецЕсли;
	КонецЕсли;
	УстановитьВидимость();	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
		Если Объект.КаналПоступления = Перечисления.КаналПоступления.Лично Тогда
			Элементы.ДатаПоступленияДокументовНаБумажномНосителе.Доступность = Ложь;
			Элементы.ДатаОбращения.Доступность = Ложь;
			Элементы.ДатаРегистрации.Доступность = Ложь;
		ИначеЕсли Объект.КаналПоступления = Перечисления.КаналПоступления.Почтой Тогда
			Элементы.ДатаПоступленияДокументовНаБумажномНосителе.Доступность = Ложь;
			Элементы.ДатаОбращения.Доступность = Истина;
			Элементы.ДатаРегистрации.Доступность = Истина;
		ИначеЕсли Объект.КаналПоступления = Перечисления.КаналПоступления.ЧерезБанкПартнер Тогда	
			Элементы.ДатаПоступленияДокументовНаБумажномНосителе.Доступность = Истина;
			Элементы.ДатаОбращения.Доступность = Ложь;
			Элементы.ДатаРегистрации.Доступность = Ложь;
		КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		Объект.КаналПоступления= Перечисления.КаналПоступления.Лично;	
	КонецЕсли;
	КаналПоступленияПриИзмененииНаСервере();
КонецПроцедуры
